ДоставкаЗаказов/src/Documents/ЗаявкаНаТранспорт/ЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаТранспорт</name>
  <basedOn>Document.ПродажаТоваров</basedOn>
  <registerRecords>AccumulationRegister.ПробегТранспорта</registerRecords>
  <registerRecords>InformationRegister.СостояниеДоставки</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйПробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузчикПервый</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузчикВторой</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <type>
      <types>EnumRef.СостояниеЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ДоставкаЗаказов/src/InformationRegisters/СоставБригады/СоставБригады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставБригады</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НачальныйПробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрузчикПервый</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрузчикВторой</name>
    <type>
      <types>CatalogRef.Грузчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДоставкаЗаказов/src/Enums/СостояниеЗаказа/СостояниеЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеЗаказа</name>
  <enumValues>
    <name>НеВыехали</name>
  </enumValues>
  <enumValues>
    <name>ВДорогеККлиенту</name>
  </enumValues>
  <enumValues>
    <name>УКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВДорогеОбратно</name>
  </enumValues>
  <enumValues>
    <name>Отработан</name>
  </enumValues>
</mdclass:Enum>

ДоставкаЗаказов/src/Documents/ЗаявкаНаТранспорт/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТранспортНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ТранспортСБригадой 		= ТранспортСБригадой(Объект.Дата);
	ОбщегоНазначенияКлиент.ФормированиеИОткрытиеФормы(ТранспортСБригадой, "Справочник.ТранспортныеСредства.ФормаВыбора", Элементы.Транспорт, "Наименование")
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, 
									ВыборДобавлением, СтандартнаяОбработка)
    СтандартнаяОбработка 	= Ложь;
    Объект.Транспорт 	= ВыбранноеЗначение;
	БригадаЗакрепленнаяЗаТранспортом();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТранспортСБригадой(Дата)
	
	ТранспортСБригадой = Новый СписокЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкаНаТранспорт.Транспорт
		|ПОМЕСТИТЬ ВТЗанятыйТранспорт
		|ИЗ
		|	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
		|ГДЕ
		|	ЗаявкаНаТранспорт.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаявкаНаТранспорт.СостояниеЗаказа <> &СостояниеЗаказа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоставБригадыСрезПоследних.Транспорт
		|ИЗ
		|	РегистрСведений.СоставБригады.СрезПоследних(, Период МЕЖДУ &ДатаНачала И &ДатаОкончания) КАК СоставБригадыСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗанятыйТранспорт КАК ВТЗанятыйТранспорт
		|		ПО СоставБригадыСрезПоследних.Транспорт = ВТЗанятыйТранспорт.Транспорт.Ссылка
		|ГДЕ
		|	ВТЗанятыйТранспорт.Транспорт ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("СостояниеЗаказа", Перечисления.СостояниеЗаказа.Отработан);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	РезультатЗапроса = Запрос.Выполнить();
	
	Текст = "Состав бригады не назначен!";
	Выборка = ОбщегоНазначенияВызовСервера.ПроверкаРезультатаЗапроса(РезультатЗапроса, Текст);
	ТранспортСБригадой = ОбщегоНазначенияВызовСервера.ФормированиеСтруктурыОтбора(Выборка, Выборка.Транспорт);
	
	Возврат ТранспортСБригадой;

КонецФункции

&НаСервере
Процедура БригадаЗакрепленнаяЗаТранспортом()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоставБригадыСрезПоследних.Водитель.Ссылка КАК Водитель,
		|	СоставБригадыСрезПоследних.ГрузчикПервый.Ссылка КАК ГрузчикПервый,
		|	СоставБригадыСрезПоследних.ГрузчикВторой.Ссылка КАК ГрузчикВторой,
		|	СоставБригадыСрезПоследних.НачальныйПробег
		|ИЗ
		|	РегистрСведений.СоставБригады.СрезПоследних(, Период МЕЖДУ &ДатаНачала И &Дата) КАК СоставБригадыСрезПоследних
		|ГДЕ
		|	СоставБригадыСрезПоследних.Транспорт = &Транспорт";
	
	Запрос.УстановитьПараметр("Транспорт", Объект.Транспорт);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	РезультатЗапроса = Запрос.Выполнить();
	
	Текст = "Состав бригады не назначен!";
	Выборка = ОбщегоНазначенияВызовСервера.ПроверкаРезультатаЗапроса(РезультатЗапроса, Текст);
	
	Выборка.Следующий();
	Объект.Водитель = Выборка.Водитель;
	Объект.ГрузчикПервый = Выборка.ГрузчикПервый;
	Объект.ГрузчикВторой = Выборка.ГрузчикВторой;
	Объект.НачальныйПробег = Выборка.НачальныйПробег;

КонецПроцедуры

#КонецОбласти
